/*
    Напишем небольшой план игры:
    Создать пустое поле для игры в крестики нолики
    Сделать инструкцию к игре
    Определить, кто будет ходить первым
    Отрисовать поле
    Если еще никто не победил и не наступила ничья
    Если сейчас ход пользователя, то получить ход пользователя
    Снова отрисовать поле с учетом хода пользователя
    Иначе
    Вычислить ход компа
    Обновить поле с учетом хода компа
    Отрисовать поле
    Передать ход сопернику
    Конец игры. Поздравить победителя или объявить ничью
*/